Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/children_s_rights_and_policy/children_and_rights_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Accounts for children of primary school age are usually simple, easy to use savings or deposit accounts that pay interest and have no charges
ga: Bíonn cuntais do leanaí bunscoile simplí go hiondúil - cuntais choigiltis nó taisce atá éasca le húsáid a íocann ús agus nach mbíonn muirir ar bith i gceist leo

source: You can open them with a very small amount of money
ga: Féadfar iad a oscailt le suim bheag airgid

source: Accounts for secondary school students usually offer ATM cards, but you have to keep the account in credit at all times
ga: Déanann cuntais do mhic léinn meánscoile cártaí ÚMB a thairiscint go hiondúil, ach caithfear an cuntas a choinneáil i gcreidmheas i gcónaí

source: They do not offer an overdraft facility and there is a limit to how much you can withdraw
ga: Ní dhéantar saoráid rótharraingte a thairiscint agus bíonn teorainn leis an méid is féidir a bhaint amach as an gcuntas

source: Usually you do not have to pay fees and charges
ga: Ní gá táillí agus muirir a íoc go hiondúil

source: You cannot open a standard current account until you are aged 18
ga: Ní féidir cuntas reatha caighdeánach a oscailt go dtí go mbíonn duine 18 mbliana d’aois

source: When opening an account each provider has different procedures
ga: Bíonn nósanna imeachta éagsúla ag gach soláthraí maidir le cuntas a oscailt

source: Some providers require that a parent or guardian sign the account opening form if you are under 16 years of age
ga: Iarrann roinnt soláthraithe go ndéanfadh tuismitheoir nó caomhnóir foirm oscailte cuntais a shíniú nuair atá an leanbh faoi bhun 16 bliana d’aois

source: Other providers only require parental permission if you are under 13 years of age
ga: Ní iarrann soláthraithe eile an cead tuismitheora ach amháin má tá an leanbh faoi bhun 13 bliana d’aois

source: More information is available in our document, Opening and switching a bank account
ga: Tuilleadh eolais ar fáil inár ndoiciméad, Cuntas bainc a oscailt agus a aistriú

source: You cannot sit on a jury in a court until you are aged 18
ga: Ní féidir leat suí ar ghiúiré sa chúirt go dtí go mbíonn tú 18 mbliana d’aois

source: Your name must be on the Register of Electors for the Dáil
ga: Caithfidh d’ainm a bheith ar Chlár na dToghthóirí don Dáil

source: You cannot make a will until you are aged 18 unless you are or have been married
ga: Ní féidir leat uacht a dhéanamh go dtí go mbíonn tú 18 mbliana d’aois mura bhfuil nó mura raibh tú pósta

source: The surname of a child can be changed in the Register of Births but only in certain circumstances
ga: Féadfar sloinne an linbh a athrú ar Chlár na mBreitheanna ach ní tharlaíonn sé ach i gcúinsí speisialta

source: However, the surname of a child can also be changed by deed poll or common usage
ga: Mar sin féin, féadfar sloinne an linbh a athrú trí ghníomhas dlí nó trí úsáid choitianta

source: Children aged between 14 and 17 years can execute the Deed Poll themselves but need the consent of both parents
ga: Féadfaidh leanaí atá idir 14 agus 17 mbliana d’aois Gníomhas Dlí a chomhlíonadh iad féin, ach bíonn toiliú ón bheirt thuismitheoir riachtanach

source: Where a child is under the age of 14 years, one of the child's parents must execute the Deed Poll with the consent of the other parent
ga: Nuair a bhíonn leanbh faoi bhun 14 bliana d’aois, caithfidh tuismitheoir amháin an Gníomhas Dlí a chomhlíonadh le toiliú an tuismitheora eile

source: You can change your name by deed poll without consent when you are aged 18 or over
ga: Féadfar d’ainm a athrú trí ghníomhas dlí gan toiliú nuair atá tú 18 mbliana d’aois nó níos sine

source: The Children's Rights Alliance in association with the Irish Council for Civil Liberties has published Know Your Rights: The Rights of Children and Young People
ga: Comhaontas Cearta na Leanaí, i gcomhar leis an gComhairle um Chearta Daonna, d'fhoilsigh Bíodh Eolas agat ar do Chearta: An Cearta Leanaí agus Daoine Óga
